Update:
Through resolving this issue, identified an engineering bug that we are working thrugh:
However, we have a successful solution:

```Terraform will perform the following actions:

  # netskope_npa_private_app.terraform_1 will be updated in-place
  ~ resource "netskope_npa_private_app" "terraform_1" {
      ~ allow_unauthenticated_cors    = false -> (known after apply)
      + allow_uri_bypass              = (known after apply)
      ~ app_option                    = {} -> (known after apply)
      ~ bypass_uris                   = [] -> (known after apply)
      ~ data                          = {
          ~ allow_unauthenticated_cors    = false -> (known after apply)
          + allow_uri_bypass              = (known after apply)
          ~ app_option                    = {} -> (known after apply)
          ~ bypass_uris                   = [] -> (known after apply)
          ~ clientless_access             = false -> (known after apply)
          ~ is_user_portal_app            = false -> (known after apply)
          + labels                        = (known after apply)
          ~ modified_by                   = "apigw" -> (known after apply)
          ~ modify_time                   = "2025-08-01 14:40:44" -> (known after apply)
          ~ policies                      = [] -> (known after apply)
          ~ private_app_hostname          = "webserver2.local" -> (known after apply)
          ~ private_app_id                = 1287 -> (known after apply)
          ~ private_app_name              = "Webserver.2" -> (known after apply)
          ~ private_app_protocol          = "" -> (known after apply)
          ~ protocols                     = [
              - {
                  - created_at = "2025-08-01T14:40:44.227Z" -> null
                  - id         = 337 -> null
                  - port       = "88" -> null
                  - service_id = 295 -> null
                  - transport  = "tcp" -> null
                  - updated_at = "2025-08-01T14:40:44.227Z" -> null
                },
            ] -> (known after apply)
          ~ public_host                   = "" -> (known after apply)
          ~ reachability                  = {
              + error_code   = (known after apply)
              + error_string = (known after apply)
              ~ reachable    = false -> (known after apply)
            } -> (known after apply)
          + real_host                     = (known after apply)
          ~ service_publisher_assignments = [
              - {
                  - publisher_name = "Terraform_3" -> null
                },
            ] -> (known after apply)
          ~ steering_configs              = [
              - "Default tenant config",
            ] -> (known after apply)
          ~ supplement_dns_for_osx        = false -> (known after apply)
          ~ tags                          = [] -> (known after apply)
          + trust_self_signed_certs       = (known after apply)
          + uribypass_header_value        = (known after apply)
          + use_publisher_dns             = (known after apply)
        } -> (known after apply)
      ~ is_user_portal_app            = false -> (known after apply)
      ~ modified_by                   = "apigw" -> (known after apply)
      ~ modify_time                   = "2025-08-01 14:40:44" -> (known after apply)
      ~ policies                      = [] -> (known after apply)
      ~ private_app_hostname          = "webserver2.local" -> "webserver.local"
      ~ private_app_id                = 1287 -> (known after apply)
      ~ private_app_name              = "Webserver.2" -> (known after apply)
      + private_app_protocol          = (known after apply)
      ~ protocols                     = [
          ~ {
              + created_at = (known after apply)
              + id         = (known after apply)
              + service_id = (known after apply)
              + updated_at = (known after apply)
                # (2 unchanged attributes hidden)
            },
        ]
      + public_host                   = (known after apply)
      ~ reachability                  = {
          + error_code   = (known after apply)
          + error_string = (known after apply)
          ~ reachable    = false -> (known after apply)
        } -> (known after apply)
      + real_host                     = (known after apply)
      ~ service_publisher_assignments = [
          - {
              - publisher_id   = 1071 -> null
              - publisher_name = "Terraform_3" -> null
              - service_id     = 1287 -> null
            },
        ] -> (known after apply)
      ~ steering_configs              = [
          - "Default tenant config",
        ] -> (known after apply)
      ~ supplement_dns_for_osx        = false -> (known after apply)
      ~ tags                          = [] -> (known after apply)
      + trust_self_signed_certs       = (known after apply)
      + uribypass_header_value        = (known after apply)
      + use_publisher_dns             = (known after apply)
        # (3 unchanged attributes hidden)
    }

```

Going through QA for testing.